#!/usr/bin/env python3
# coding:utf-8

'''
n + 100 = i^2, n + 268 = j^2
=> n  ->  i^2  ->  j^2

i^2 - 100 <= 10000
=> i < 100.5
又 i 为整数
=> i 的上限为 100

同理，由 j^2 - 268 <= 10000
=> j 的上限为 101

其实，借鉴 004_04.py 可知 i 与 j 的上限分别为 83 与 84

算式 sqrt(n + 100) 与 sqrt(n + 268) 成立，且分别对应 i 与 j
=> n >= -100
=> sqrt(n + 100) >= 0，即 i >= 0
=> sqrt(n + 268) = sqrt(168)
又 j 为整数
=> j >= 13
=> i 的下限为 0，j 的下限为 13
'''
a, b = set(), set()

for i in range(84):			# 0 <= i <= 83
    a.add(i**2 - 100)		# 集合 a 中的数 n 均满足 (n + 100) 为完全平方数

for j in range(13, 85):		# 13 <= j <= 84
    b.add(j**2 - 268)		# 集合 b 中的数 n 均满足 (n + 268) 为完全平方数

c = list(a & b)				# 将 a 与 b 的交集放入列表
c.sort()					# 排序

print(c)

